In [16]:
#numpy.copy()
import numpy as np
x=np.array([[5,6,7],[8,9,22]])
y=x.copy()
x[0,0]= 1000
y[0,0]=1001
z=y.copy()
z[0,0]=1002
print(x)
print(y)
print(z)

[[1000    6    7]
 [   8    9   22]]
[[1001    6    7]
 [   8    9   22]]
[[1002    6    7]
 [   8    9   22]]

In [24]:
import pandas as pd
data1=[1,2,3,4,'abcd']
print(data1)
data2=[2,5,6,7,9]
print(data2)
df1=pd.DataFrame(data2)
#df2=pd.DataFrame(data1)
print(df1)
#print(df2)
print(type(df1[0]))

[1, 2, 3, 4, 'abcd']
[2, 5, 6, 7, 9]
   0
0  2
1  5
2  6
3  7
4  9
<class 'pandas.core.series.Series'>

In [42]:
import pandas as pd
data=([['RICK',21.121],['THIMPU',19.4654]])
p1=pd.DataFrame(data,index=[1,2],columns=['NAME','AGE'],dtype=int)#index mane row #column mane columns
print(p1)

     NAME  AGE
1    RICK   21
2  THIMPU   19

In [ ]:
import pandas as pd
d1={'Name' :['ab','cd',10],'age':[23,50,60]}
p1=pd.DataFrame(d1,index=['x','y','z'])
print(p1)
print(p1.Name.dtypes)

#IF THE DATATYPE ARE DIFFERENT THEN IT IS TREATED AS OBJECT

In [53]:
import pandas as pd
d1=[{'Name':'Abcd','Age':80},{'Name':'xyz','Age1':80,'Test':89}]
p1=pd.DataFrame(d1,index=[1,2])
print(p1)

    Age  Age1  Name  Test
1  80.0   NaN  Abcd   NaN
2   NaN  80.0   xyz  89.0

In [60]:
import pandas as pd
d1=[{'Name':'Abcd','Age':80},{'Name':'xyz','Age1':82,'Test':89}]
p1=pd.DataFrame(d1,columns=['Name','Age1'],index=[1,2])
print(p1)

   Name  Age1
1  Abcd   NaN
2   xyz  82.0

In [2]:
import pandas as pd
d1=pd.read_csv('u.csv',header=None)
print(d1)

   0    1    2
0  a  123   90
1  b   50   65
2  c   50  522

In [13]:
import pandas as pd
d1=pd.read_csv('u.csv',names=['x','y','z'])
print(d1.index)
print(d1)

RangeIndex(start=0, stop=3, step=1)
   x    y    z
0  a  123   90
1  b   50   65
2  c   50  522

In [4]:
print(d1.dtypes)
d1.head(2)#OPOR DIE DEKHABE
#d1.tail(2)#NICHE DIE DEKHABE

0    object
1     int64
2     int64
dtype: object

   0    1   2
0  a  123  90
1  b   50  65

In [5]:
d1.values

array([['a', 123, 90],
       ['b', 50, 65],
       ['c', 50, 522]], dtype=object)

In [8]:
d1.index

RangeIndex(start=0, stop=3, step=1)

In [14]:
print(d1)

   x    y    z
0  a  123   90
1  b   50   65
2  c   50  522

In [21]:
print(d1['z'].max())
print(d1['z'].min())
print(d1['z'].unique())
print(d1['y'].unique())
print(d1['x'].describe())

522
65
[ 90  65 522]
[123  50]
count     3
unique    3
top       c
freq      1
Name: x, dtype: object

In [16]:
import pandas as pd
import numpy as np
d=[1,2,3,4,5,6,7,8,9]
e=pd.DataFrame(d)
e.columns=['COL1']
e['NEW COL']=np.arange(1,10)
e.index=[1,2,3,4,5,6,7,8,9]
print(e)

   COL1  NEW COL
1     1        1
2     2        2
3     3        3
4     4        4
5     5        5
6     6        6
7     7        7
8     8        8
9     9        9

In [19]:
e['NEW COL']=e['NEW COL'] + 1
print(e)

   COL1  NEW COL
1     1        2
2     2        3
3     3        4
4     4        5
5     5        6
6     6        7
7     7        8
8     8        9
9     9       10

In [20]:
del e['NEW COL']
print(e)

   COL1
1     1
2     2
3     3
4     4
5     5
6     6
7     7
8     8
9     9

In [24]:
i=['a','b','c','d','e','f','g','h','i']
e.index=i
print(e)

   COL1
a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9

In [27]:
e.loc['b' : 'e'] #INDEX

   COL1
b     2
c     3
d     4
e     5

In [28]:
e.iloc[2:6] #INDEX LOCATION ORIGINAL

   COL1
c     3
d     4
e     5
f     6

In [29]:
e.columns=['COL1']
e['NEW COL']=np.arange(1,10)
print(e)

   COL1  NEW COL
a     1        1
b     2        2
c     3        3
d     4        4
e     5        5
f     6        6
g     7        7
h     8        8
i     9        9

In [34]:
e.iat[6,1] #[ROW NO ORIGINAL,COLUMN ORIGINAL]

6

In [35]:
e.ix[1]# FUTURE E KAJ KORBE NA

C:\Users\admin\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

COL1       2
NEW COL    2
Name: b, dtype: int64

In [36]:
e.at['g','COL1']

7

In [37]:
e.fillna(0) #JODI STRING  THAKE TAHLE 0 hbe

   COL1  NEW COL
a     1        1
b     2        2
c     3        3
d     4        4
e     5        5
f     6        6
g     7        7
h     8        8
i     9        9